steps = 0
v_3 = 0
v_5 = 0
while v_5 != 4:
  print ("Что делаем дальше с 5-литровиком?\n 1: наполнить\n 2: вылить\n 3: перелить в 3-литровик\n 4: ничего\n 0: выход")
  b = input ()
  if b == '1':
    v_5 = 5
  if b == '2':
    v_5 = 0
  if b == '3':
    if v_5 + v_3 < 3:
      v_3 = v_5
      v_5 = 0
    if v_5 + v_3 >= 3:
      v_5 = v_5 + v_3 - 3
      v_3 = 3
  if b == '4':
    v_5 == v_5
  if b == '0':
    break
  steps += 1
  print (f"5-литровик = {v_5} л, 3-литровик = {v_3} л, шагов = {steps}")
  print ("Что делаем дальше с 3-литровиком?\n 1: наполнить\n 2: вылить\n 3: перелить в 5-литровик\n 4: ничего\n 0: выход")
  b = input ()
  if b == '1':
    v_3 = 3
  if b == '2':
    v_3 = 0
  if b == '3':
    if v_5 + v_3 < 5:
      v_5 = v_3 + v_5
      v_3 = 0
    if v_5 + v_3 >= 5:
      v_3 = v_5 + v_3 - 5
      v_5 = 5
  if b == '4':
    v_3 == v_3
  if b == '0':
    break
  steps += 1
  print (f"5-литровик = {v_5} л, 3-литровик = {v_3} л, шагов = {steps}")
else:
  print ("ПОБЕДА!")